EDT/МПСтриж/src/Documents/Рейс/Рейс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Рейс</name>
  <posting>Deny</posting>
  <attributes>
    <name>НомерРейса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРейса</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.Транспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПалеты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипИнформированияПолучателейЗаказов</name>
    <type>
      <types>EnumRef.ТипыИнформированияПолучателейЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>РассылкаСМСПроизведена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.Экспедиторы</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыданТерминалAssist</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаспечатанМЛ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипФинальнойТочкиМаршрута</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресФинальнойТочкиМаршрута</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиротаФинальнойТочкиМаршрута</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолготаФинальнойТочкиМаршрута</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроизведенаЯндексМаршрутизация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

EDT/МПСтриж/src/Enums/ТипЗаказа/ТипЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипЗаказа</name>
  <enumValues>
    <name>Доставка</name>
  </enumValues>
  <enumValues>
    <name>Забор</name>
  </enumValues>
  <enumValues>
    <name>Фрахт</name>
  </enumValues>
</mdclass:Enum>

EDT/МПСтриж/src/Documents/Заказ/Заказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заказ</name>
  <posting>Deny</posting>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЦентр</name>
    <type>
      <types>EnumRef.СтатусыЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтернетМагазин</name>
    <type>
      <types>CatalogRef.ИнтернетМагазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Широта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Долгота</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВодитель</name>
    <type>
      <types>EnumRef.СтатусыЗаказаВодитель</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПереноса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказаПереноса</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДоставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыбиратьТипОплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СнятьСДоставки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РезультатДоставки</name>
    <type>
      <types>CatalogRef.РезультатыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>ТарифнаяСетка</name>
    <type>
      <types>CatalogRef.ТарифныеСетки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодъемОплаченПартнером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоСКлиента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьИтогоСКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧастичныйВыкупЗапрещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЗабора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДСФЗПоДоставке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПечататьЧек</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>EmailКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьЧекНаEmail</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОрганизацииНаличнойОплаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОрганизацииОплатыПоТерминалу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаФормированияЧекаНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодыОплатыПодъемаЗаказа</name>
    <type>
      <types>EnumRef.МетодыОплатыПодъемаЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаТипаОплатыЗапрещена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокСортировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.ИнтернетМагазины</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРейса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрашиватьДанныеОТипеПодъема</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонСМС</name>
    <type>
      <types>CatalogRef.ШаблоныСМСРассылок</types>
    </type>
  </attributes>
  <attributes>
    <name>КодЗоныТарификации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодИдентификацииКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяКодИдентификацииКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОрганизацииОплатыПоСБП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяОплатаСтоимостиДоставкиПриОтменеЗаказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПредоплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписаниеИВозвратСопрДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеобходимаТарификацияПримерки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВведенныйКИК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КалендарьДоставки</name>
    <type>
      <types>CatalogRef.КалендариДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВремяПоследнейМаршрутизацииВМП</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодМаркировки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоставщикТовара</name>
      <type>
        <types>CatalogRef.ПоставщикиТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакПредметаРасчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасчетСтоимостиДоставки</name>
    <attributes>
      <name>СуммаВыкупа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/МПСтриж/src/Documents/Рейс/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	ТолькоПросмотр = Истина;
КонецПроцедуры

&НаСервере
Процедура УстановитьОбщийНомерТелефонаДляЗаказовНаСервере()
	// Вставить содержимое обработчика.
	Зап = Новый Запрос;
	
	Зап.Текст = "ВЫБРАТЬ
	            |	Заказ.Ссылка КАК Заказ
	            |ИЗ
	            |	Документ.Заказ КАК Заказ
	            |ГДЕ
	            |	Заказ.Рейс = &Рейс
	            |	И Заказ.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипЗаказа.Доставка)
	            |	И Заказ.СнятьСДоставки = ЛОЖЬ
	            |	И Заказ.РезультатДоставки = ЗНАЧЕНИЕ(справочник.результатыДоставки.КДоставке)";
	
	
	Зап.УстановитьПараметр("Рейс", Объект.Ссылка);
	
	Выб = Зап.Выполнить().Выбрать();
	
	Пока Выб.Следующий() Цикл
		Заказ = Выб.Заказ.ПолучитьОбъект();
		Заказ.Телефон = "+79160801884";
		
		Заказ.Записать(РежимЗаписиДокумента.Запись);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбщийНомерТелефонаДляЗаказов(Команда)
	Пар = "112200";
	Стр = "шщукпез3";
	Если ВвестиСтроку(Стр, "Укажите пароль..", 10, Ложь) Тогда
		Если Стр = Пар Тогда
			УстановитьОбщийНомерТелефонаДляЗаказовНаСервере();
		КонецеСли;	
	КонецеСли;	
КонецПроцедуры
